Revit 2024 API
Construction.Id Property
Get the id of the Construction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string Id { get; }
Visual Basic
Public ReadOnly Property Id As String
	Get
Visual C++
public:
property String^ Id {
	String^ get ();
}
Remarks
This property is used to get the id of the Construction.
See Also
Construction Class
Autodesk.Revit.DB Namespace